Revit 2027 API
FabricationConfiguration.ReloadConfiguration Method
 Reloads the fabrication configuration from its source fabrication configuration.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConfigurationReloadInfo ReloadConfiguration()
Public Function ReloadConfiguration As ConfigurationReloadInfo
public:
ConfigurationReloadInfo^ ReloadConfiguration()
member ReloadConfiguration : unit -> ConfigurationReloadInfo
Return Value
ConfigurationReloadInfo
 The information about the reload of the fabrication configuration.
Exceptions
Exception | Condition
InvalidOperationException |  The fabrication configuration is not set yet. -or- The source fabrication configuration could not be found. -or- this operation failed.
Remarks
 The configuration must be reloaded from its source fabrication configuration before loading new fabrication services or additional parts.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace